Revit 2024 API
BuiltInFailures.CreationFailures.CannotMakeRoofFromVerticalFaceError Property
 Can't make roof from vertical face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMakeRoofFromVerticalFaceError { get; }
Visual Basic
Public Shared ReadOnly Property CannotMakeRoofFromVerticalFaceError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMakeRoofFromVerticalFaceError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace